adafruit/Adafruit_nRF52_Arduino/boards.txt
# Copyright (c) 2014-2015 Arduino LLC.  All right reserved.
# Copyright (c) 2016 Sandeep Mistry All right reserved.
# Copyright (c) 2017 Adafruit Industries.  All right reserved.
#
# This library is free software; you can redistribute it and/or
# modify it under the terms of the GNU Lesser General Public
# License as published by the Free Software Foundation; either
# version 2.1 of the License, or (at your option) any later version.
#
# This library is distributed in the hope that it will be useful,
# but WITHOUT ANY WARRANTY; without even the implied warranty of
# MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
# See the GNU Lesser General Public License for more details.
#
# You should have received a copy of the GNU Lesser General Public
# License along with this library; if not, write to the Free Software
# Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA  02110-1301  USA

menu.softdevice=Bootloader
menu.debug=Debug Mode

#**********************************************
# Feather nrf52 Board
#**********************************************
feather52.name=Adafruit Bluefruit nRF52 Feather
feather52.bootloader.tool=bootburn

# Upload
feather52.upload.tool=nrfutil
feather52.upload.protocol=nrfutil

# Build
feather52.build.mcu=cortex-m4
feather52.build.f_cpu=64000000
feather52.build.board=NRF52_FEATHER
feather52.build.core=nRF5
feather52.build.variant=feather52

# SofDevice Menu
# Ram & ROM size varies depending on S132 (check linker script)
feather52.menu.softdevice.s132v201=0.5.0 dual, S132 2.0.1
feather52.menu.softdevice.s132v201.build.sd_flags=-DS132 -DSD_VER=201
feather52.menu.softdevice.s132v201.build.sd_name=s132
feather52.menu.softdevice.s132v201.build.sd_version=2.0.1
feather52.menu.softdevice.s132v201.build.sd_fwid=0x0088
feather52.menu.softdevice.s132v201.build.bootfile=0.5.0/dual/feather52_bootloader_v050_s132_v201
feather52.menu.softdevice.s132v201.upload.maximum_size=165888
feather52.menu.softdevice.s132v201.upload.maximum_data_size=51072

feather52.menu.softdevice.s132v510=5.1.0 dual, S132 5.1.0
feather52.menu.softdevice.s132v510.build.sd_flags=-DS132 -DSD_VER=510
feather52.menu.softdevice.s132v510.build.sd_name=s132
feather52.menu.softdevice.s132v510.build.sd_version=5.1.0
feather52.menu.softdevice.s132v510.build.sd_fwid=0x00A5
feather52.menu.softdevice.s132v510.build.bootfile={build.sd_version}/dual/feather52_bootloader_5.1.0_s132_dual
feather52.menu.softdevice.s132v510.upload.maximum_size=151552
feather52.menu.softdevice.s132v510.upload.maximum_data_size=51072

# Debug Menu
feather52.menu.debug.l0=Level 0 (Release)
feather52.menu.debug.l0.build.debug_flags=-DCFG_DEBUG=0 -Os
feather52.menu.debug.l1=Level 1 (Error Message)
feather52.menu.debug.l1.build.debug_flags=-DCFG_DEBUG=1 -Os
feather52.menu.debug.l2=Level 2 (Full Debug)
feather52.menu.debug.l2.build.debug_flags=-DCFG_DEBUG=2 -Os
feather52.menu.debug.l3=Level 3 (Segger SystemView)
feather52.menu.debug.l3.build.debug_flags=-DCFG_DEBUG=3 -Os

# required if using native usb ( for reference )
#feather52.upload.use_1200bps_touch=false
#feather52.upload.wait_for_upload_port=false
#feather52.upload.native_usb=false

#**********************************************
# Metro nrf52 Board
#**********************************************
#metro52.name=Adafruit Bluefruit nRF52 Metro
#metro52.bootloader.tool=nrfjprog

# Upload
#metro52.upload.tool=nrfutil
#metro52.upload.protocol=nrfutil
#metro52.upload.maximum_size=167936
#metro52.upload.maximum_data_size=51072

# Build
#metro52.build.mcu=cortex-m4
#metro52.build.f_cpu=64000000
#metro52.build.board=NRF52_METRO
#metro52.build.core=nRF5
#metro52.build.variant=metro52

# Debug Menu
#metro52.menu.debug.l0=Level 0 (Release)
#metro52.menu.debug.l0.build.debug_flags=-DCFG_DEBUG=0 -Os
#metro52.menu.debug.l1=Level 1 (Error Message)
#metro52.menu.debug.l1.build.debug_flags=-DCFG_DEBUG=1 -Os
#metro52.menu.debug.l2=Level 2 (Full Debug)
#metro52.menu.debug.l2.build.debug_flags=-DCFG_DEBUG=2 -Os
#metro52.menu.debug.l3=Level 3 (Segger SystemView)
#metro52.menu.debug.l3.build.debug_flags=-DCFG_DEBUG=3 -Og
